opencomputeproject/Time-Appliance-Project/Incubation/Software/RCB_WWVB_LORA/V2/RCB_WWVB/stm32_pps.cpp

#include "stm32_pps.h"



void debug_print_hrtimer_common_registers() 
{
  sprintf(print_buffer,"HRTimer Common registers:\r\n");
  sprintf(print_buffer,"%s EECR1=0x%x\r\n", print_buffer, HRTIM1->sCommonRegs.EECR1);
  sprintf(print_buffer,"%s EECR2=0x%x\r\n", print_buffer, HRTIM1->sCommonRegs.EECR2);
  sprintf(print_buffer,"%s EECR3=0x%x\r\n", print_buffer, HRTIM1->sCommonRegs.EECR3);
  Serial.print(print_buffer);  
}

void debug_print_hrtimer_registers(int TimerIdx)
{
  sprintf(print_buffer,"Timer %d registers:\r\n", TimerIdx);
  sprintf(print_buffer,"%s TIMxCR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].TIMxCR);
  sprintf(print_buffer,"%s TIMxISR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].TIMxISR);
  sprintf(print_buffer,"%s TIMxICR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].TIMxICR);
  sprintf(print_buffer,"%s TIMxDIER=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].TIMxDIER);
  sprintf(print_buffer,"%s CNTxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CNTxR);
  sprintf(print_buffer,"%s PERxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].PERxR);
  sprintf(print_buffer,"%s REPxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].REPxR);
  sprintf(print_buffer,"%s CMP1xR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CMP1xR);
  sprintf(print_buffer,"%s CMP1CxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CMP1CxR);
  sprintf(print_buffer,"%s CMP2xR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CMP2xR);
  sprintf(print_buffer,"%s CMP3xR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CMP3xR);
  sprintf(print_buffer,"%s CMP4xR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CMP4xR);
  sprintf(print_buffer,"%s CPT1xR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CPT1xR);
  sprintf(print_buffer,"%s CPT2xR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CPT2xR);
  sprintf(print_buffer,"%s DTxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].DTxR);
  sprintf(print_buffer,"%s SETx1R=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].SETx1R);
  sprintf(print_buffer,"%s RSTx1R=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].RSTx1R);
  

  sprintf(print_buffer,"%s SETx2R=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].SETx2R);
  sprintf(print_buffer,"%s RSTx2R=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].RSTx2R);
  sprintf(print_buffer,"%s EEFxR1=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].EEFxR1);
  sprintf(print_buffer,"%s EEFxR2=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].EEFxR2);
  sprintf(print_buffer,"%s RSTxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].RSTxR);
  sprintf(print_buffer,"%s CHPxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CHPxR);
  sprintf(print_buffer,"%s CPT1xCR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CPT1xCR);
  sprintf(print_buffer,"%s CPT2xCR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].CPT2xCR);
  sprintf(print_buffer,"%s OUTxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].OUTxR);
  sprintf(print_buffer,"%s FLTxR=0x%x\r\n", print_buffer, HRTIM1->sTimerxRegs[TimerIdx].FLTxR);

  Serial.print(print_buffer);  

}




// STM HAL API variables
extern "C" {
  DMA_HandleTypeDef hdma_hrtim;
  HRTIM_HandleTypeDef hhrtim;
}

// PPS Input variables
// just defining a set of global variables
// assume PPS input is slow enough, don't need any fifo stuff
extern "C" {
  uint64_t phc_sec_ts = 0;
  float phc_ns_ts = 0;
  uint16_t capture_ts = 0;
  uint16_t dma_remaining_ts = 0;
  uint16_t typical_count_ts = 0;
  uint64_t millis_ts = 0;
  bool valid_ts = 0;
}


// PPS output variables
extern "C" {
  // top level PHC basically, seconds and nanoseconds
  uint64_t phc_seconds = 0; // TOD basically
  float phc_nanoseconds = 0; // nanoseconds
  const float nano_per_tick = ((1.0/480.0e6)*1e9);

  uint64_t dma_complete_counter = 0;
  uint64_t timc_interrupt_counter = 0;

  bool set_next_output = 1; // has to start out as 1! output starts at reset
  // if you don't do this , it will mess up
}

extern "C" {


  // X is DMA roll over counter, Y is the single fine roll over
  // utility calculation function
  void adjust_timing(float adjustment_ns, uint16_t *X, uint16_t *Y) {
    // Constants
    const float clock_frequency_hz = 480000000.0; // 480 MHz
    const float clock_period_ns = 1e9 / clock_frequency_hz; // Clock period in nanoseconds

    if ( adjustment_ns > 400e6 ) {
      adjustment_ns = 400e6;
    } else if ( adjustment_ns < -400e6 ) {
      adjustment_ns -= 400e6;
    }
    // compute how many counter ticks to adjust by
    int64_t tick_adjust = (int64_t) (adjustment_ns / clock_period_ns);

    int64_t cur_ticks = (*X * DMA_PPS_COUNT) + *Y;

    cur_ticks += tick_adjust;

    uint32_t start_dma_hrtimer_count = 0;
    start_dma_hrtimer_count = (uint32_t) (cur_ticks - 0xffdf) / DMA_PPS_COUNT ;
    uint32_t remainder = 0;
    remainder = cur_ticks - (start_dma_hrtimer_count * DMA_PPS_COUNT);
    sprintf(print_buffer,"adjust_timing, start_dma_count=%u, remainder=%u\r\n", start_dma_hrtimer_count, remainder);
    Serial.println(print_buffer);

    if ( remainder > 0xffdf ) {
      remainder -= DMA_PPS_COUNT;
      start_dma_hrtimer_count++;
    }
    // remainder is new fine value, Y
    // start_dma_hrtimer_count is new DMA value, X
    *Y = remainder;
    *X = start_dma_hrtimer_count;
    return;
  } 

  // PPS is generated with a two step process
  // 1. First step, uses DMA for the bulk of the time
  //      DMA counts DMA_PPS_COUNT roll overs of HRTIMER
  //      HRTIMER is roll over point is set by typical_count
  // 2. Second step, on DMA completing DMA_PPS_COUNT roll overs
  //      next hrtimer is set to toggle the output and DMA is disabled
  //      this single rollover point is set by fine_count
  //      when that toggle occurs, rollover point set back to typical_count and dma enabled again
  // fine_count should be as large as possible to prevent race conditions
  uint16_t typical_count = 34277;
  uint16_t fine_count = 61000;
  uint16_t next_typical_count = 34277;
  uint16_t next_fine_count = 61000;

  // In order to generate a step in the PPS output
  // need to do a one time adjustment of typical_count and fine_count
  // make sure to keep fine_count as large as possible
  // keep the original, adjust it once, after next edge set them back
  bool doing_typical_step = 0;
  bool doing_fine_step = 0;
  uint16_t orig_typical_count = 34277;
  uint16_t orig_fine_count = 61000;

  // utility function to keep PHC aligned with running operation
  float nanoseconds_temp = 0;
  uint64_t seconds_temp = 0;
  void add_to_phc(uint64_t hrtimer_ticks) 
  {
    // compute this in nanoseconds
    nanoseconds_temp = (float) ( ((float)hrtimer_ticks) * nano_per_tick);

