opencomputeproject/Time-Appliance-Project/Incubation/Software/RCB_WWVB_LORA/V2/RCB_WWVB/stm32_pps.cpp
  adjust_timing( (float) step_val_ns, &temp_typical, &temp_fine);

  next_typical_count = temp_typical;
  next_fine_count = temp_fine;
  doing_typical_step = 1;
  doing_fine_step = 1;
}

// in order to generate a frequency adjustment in pps output
// need to do an adjustment of typical_count and fine_count
// and not adjust them back
void pps_freq_adjust(int64_t ns_freq_adj) 
{
  uint16_t temp_typical, temp_fine;
  temp_typical = typical_count;
  temp_fine = fine_count;
  adjust_timing( (float) ns_freq_adj, &temp_typical, &temp_fine);

  orig_typical_count = temp_typical;
  orig_fine_count = temp_fine;
}




uint64_t last_dma_counter = 0;
uint64_t last_timc_counter = 0;

bool test_jump_forward = 1;
bool test_speed_up = 1;


uint32_t last_capture_val = 0xa5a5;
bool last_eev_pin_val = 0;


void loop_stm_pps_out()
{
  static uint64_t last_out_millis = 0;
  if ( millis() - last_out_millis > 5000 ) {
    last_out_millis = millis();
    /*
    // test jumping
    if ( test_jump_forward ) {
      pps_step(200*1000*1000);
      Serial.println("PPS Test jump forward!");
    } else {
      pps_step(-200*1000*1000);
      Serial.println("PPS Test jump backward!");
    }
    test_jump_forward = !test_jump_forward;
    */
    // test frequency adjustment
    /*
    if ( test_speed_up ) {
      pps_freq_adjust(100*1000*1000); 
      Serial.println("PPS Test speed up!");
    } else {
      pps_freq_adjust(-100*1000*1000);
      Serial.println("PPS Test slow down!");
    }
    test_speed_up = !test_speed_up;
    */

  }
  if ( last_dma_counter != dma_complete_counter) {
    last_dma_counter = dma_complete_counter;
    sprintf(print_buffer, "Loop stm pps dma counter increment to %d\r\n", 
      dma_complete_counter);
    Serial.print(print_buffer);
  }
  if ( last_timc_counter != timc_interrupt_counter  )
  {
    last_timc_counter = timc_interrupt_counter;
    sprintf(print_buffer, "Loop stm pps timc interrupt counter increment to %d\r\n", timc_interrupt_counter);
    Serial.print(print_buffer);
  }
  
  

}

void loop_stm_pps_in()
{
  static uint64_t last_in_millis = 0;
  if ( millis() - last_in_millis > 5000 ) {
    last_in_millis = millis();
    HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_9); // debug toggle this pin , pin 6 on RCB header
    Serial.println("Toggling PA9!");
    delay(10);
    //debug_print_hrtimer_registers(HRTIM_TIMERINDEX_TIMER_C);
    //debug_print_hrtimer_common_registers();
  }
  if ( valid_ts ) {
    sprintf(print_buffer, "Got PPS Input! Timestamp info:\r\n");
    sprintf(print_buffer, "%s   PHC_SEC_TS=%" PRIu64 "\r\n", print_buffer, phc_sec_ts);
    sprintf(print_buffer, "%s   PHC_NS_TS=%f\r\n", print_buffer, phc_ns_ts);
    sprintf(print_buffer, "%s   Capture_TS=%" PRIu16 "\r\n", print_buffer, capture_ts);
    sprintf(print_buffer, "%s   DMA_Remaining_TS=%" PRIu16 "\r\n", print_buffer, dma_remaining_ts);
    sprintf(print_buffer, "%s   Typical_Count_TS=%" PRIu16 "\r\n", print_buffer, typical_count_ts);
    sprintf(print_buffer, "%s   Millis_TS=%" PRIu64 "\r\n", print_buffer, millis_ts);
    Serial.println(print_buffer);
    valid_ts = 0;

    // need to post-process this data captured in the interrupt to get a "real" timestamp
    // phc_sec_ts / phc_ns_ts are old, they're only updated by other interrupt handlers after events have happened
    // so that's the starting point
    // capture_ts is the fine value, how many hrtimer ticks since last reset

    uint64_t timestamp_seconds = 0;
    float temp_ns = 0;
    uint64_t timestamp_nanoseconds = 0;
    if ( dma_remaining_ts != DMA_PPS_COUNT )
    {
      // this is most common case, somewhere between toggles
      // math is a bit simpler
      // PHC value + (capture_ts * ns_per_tick) + (DMA_PPS_COUNT - dma_remaining_ts) * typical_count_ts * ns_per_tick
      // PHC value is old looking, but its the time of the last event basically
      // capture_ts is fine resolution, just add it
      // then account for how many DMA transactions have already occurred in this cycle
      timestamp_seconds = phc_sec_ts;
      temp_ns = phc_ns_ts;
      temp_ns += ((float) capture_ts) * nano_per_tick;
      temp_ns += ((float) (DMA_PPS_COUNT - dma_remaining_ts) ) * ((float)typical_count_ts) * nano_per_tick;
      while ( temp_ns >= 1.0e9 ) {
        temp_ns -= 1.0e9;
        timestamp_seconds += 1;
      }
      timestamp_nanoseconds = (uint64_t) temp_ns;

      
    } else 
    {
      Serial.println("*******SPECIAL TIMESTAMP CASE, NEED TO IMPLEMENT*******");
      // this is a special case, this has two sub cases
      // 1. This is right after a toggle , need to check what interrupt flags are set
      // 2. This is right before a toggle, also need to check interrupt flags set
    }
    sprintf(print_buffer,
      "High level timestamp: %" PRIu64 " seconds, %" PRIu64 " nanoseconds\r\n", timestamp_seconds, timestamp_nanoseconds);
    Serial.print(print_buffer);
  }
  
}

void loop_stm_pps()
{
  if ( last_millis == 0 ) {
    return;
  }
  loop_stm_pps_out();
  loop_stm_pps_in();


}